
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МассивУчастниковОбмена = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "МассивУчастниковОбмена", Неопределено);
	АдресПараметрыРегистрации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "АдресПараметрыРегистрации", Неопределено);

	Если МассивУчастниковОбмена = Неопределено Тогда
		ЗакрытьСразу = Истина
	Иначе
		Для каждого Стр Из МассивУчастниковОбмена Цикл
		
			НСтр = УчастникиОбъектаОбмена.Добавить();
			ЗаполнитьЗначенияСвойств(НСтр, Стр);
			//НСтр.БазаПриемник = Эл;
			//НСтр.Выбрать = Истина;
		
		КонецЦикла; 	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗакрытьСразу = Истина Тогда
		ПодключитьОбработчикОжидания("ЗакрытьСразу", 0.1, Истина);
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСразу()  Экспорт
	Закрыть();	
КонецПроцедуры


&НаКлиенте
Процедура УчастникиОбъектаОбменаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьПризнакВыбран(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	УстановитьПризнакВыбран(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	
	//МассивУчастниковОбмена = Новый Массив;
	//СтрПоиска = УчастникиОбъектаОбмена.НайтиСтроки(Новый Структура("Выбрать", Истина)); 
	//Для каждого Эл Из СтрПоиска Цикл
	//	МассивУчастниковОбмена.Добавить(Эл.БазаПриемник);		
	//КонецЦикла;
	
	//МассивУчастниковОбмена = СобратьМассивУчастниковОбмена();
	
	//Закрыть(Новый Структура("МассивУчастниковОбмена, МассивОбъектовОбмена, ТекущийПользователь", МассивУчастниковОбмена, Параметры.МассивОбъектовОбмена, ТекущийПользователь));	
	
	ВыбранСтроки = УчастникиОбъектаОбмена.НайтиСтроки(Новый Структура("Выбрать", Истина)); 
	
	Если ВыбранСтроки.Количество() = 0 Тогда
		МассивУчастниковОбмена = Неопределено;	
	Иначе
		
		МассивУчастниковОбмена = Новый Массив;
		
		Для каждого Стр Из ВыбранСтроки Цикл
			
			Если Стр.Выбрать = Ложь Тогда
				Продолжить;
			КонецЕсли;
			
			МассивУчастниковОбмена.Добавить(Стр.БазаПриемник);	
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	Закрыть(Новый Структура("МассивУчастниковОбмена, АдресПараметрыРегистрации", МассивУчастниковОбмена, АдресПараметрыРегистрации));	
	
КонецПроцедуры

&НаСервере
Функция СобратьМассивУчастниковОбмена()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Выразить(ТЗ.Вырать КАК Булево) КАК Вырать,
		//|	ТЗ.БазаПриемник КАК БазаПриемник,
		//|	ТЗ.ИДБазыПриемник КАК ИДБазыПриемник
		//|ПОМЕСТИТЬ ВТ_Начало
		//|ИЗ
		//|	&ТЗ КАК ТЗ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	*
		//|ИЗ
		//|	ВТ_Начало КАК ВТ_Начало
		//|ГДЕ
		//|	ВТ_Начало.Вырать = ИСТИНА
		//|";
	
		"ВЫБРАТЬ
		|	*
		|ПОМЕСТИТЬ ВТ_Начало
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	*
		|ИЗ
		|	ВТ_Начало КАК ВТ_Начало
		|ГДЕ
		|	ВТ_Начало.Выбрать = ИСТИНА
		|";
		
	Запрос.УстановитьПараметр("ТЗ", УчастникиОбъектаОбмена.Выгрузить());	
	РЗ = Запрос.Выполнить();
	
	Модуль = пр_НастройкиПовтИсп.ИсполняемыйМодуль("пр_Общий", пр_НастройкиПовтИсп.ТекущийПользователь()); 
	Возврат Модуль.МассивСтруктурПоЗапросу(РЗ);
	
КонецФункции 

&НаКлиенте
Процедура УстановитьПризнакВыбран(Значение)
	Для каждого Стр Из УчастникиОбъектаОбмена Цикл
		Стр.Выбрать = Значение;
	КонецЦикла; 
КонецПроцедуры
