
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ИнициализироватьКомпоновщикНастроек();
КонецПроцедуры

&НаСервере
//  Инициализирует компоновщик настроек
//
Процедура ИнициализироватьКомпоновщикНастроек()

	СхемаКомпоновкиДанных = ОбъектНаСервере().ПолучитьМакет("МакетОтбор");
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор)));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
	Элементы.КомпоновщикНастроекНастройкиОтбор.Обновить();	
	
КонецПроцедуры // ИнициализироватьКомпоновщикНастроек()

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция ОбъектНаСервере()
	Возврат РеквизитФормыВЗначение("Отчет");
КонецФункции // ОбъектНаСервере()

&НаСервере
Процедура СформироватьНаСервере()
	Отборы = Отборы();
КонецПроцедуры

Функция Отборы()
	
	СхемаКомпоновкиДанных = ОбъектНаСервере().ПолучитьМакет("МакетОтбор");
		
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);		
	
	// Таблица значений, в которое будет получен результат
	//Результат = РеквизитФормыВЗначение("ТаблицаЭлементов");
	ТЗ = Новый ТаблицаЗначений;
		
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.УстановитьОбъект(ТЗ);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	//Для каждого СтрокаТЧ Из Результат Цикл
	//	СтрокаТЧ.GUID = XMLСтрока(СтрокаТЧ.Ссылка);
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(Результат, "ТаблицаЭлементов");
	Возврат ТЗ;
	
КонецФункции // НайтиЭлементыСервер()
